VDowbensky/efr32_baremetal/baremetal_test/chip/efr32fg1v_synth.h
/***************************************************************************//**
 * @file
 * @brief EFR32FG1V_CRC register and bit field definitions
 *******************************************************************************
 * # License
 * <b>Copyright 2020 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 ******************************************************************************/

#if defined(__ICCARM__)
#pragma system_include       /* Treat file as system include file. */
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
#pragma clang system_header  /* Treat file as system include file. */
#endif

/***************************************************************************//**
 * @addtogroup Parts
 * @{
 ******************************************************************************/
/***************************************************************************//**
 * @defgroup EFR32FG1V_SYNTH
 * @{
 * @brief EFR32FG1V_SYNTHRegister Declaration
 ******************************************************************************/
/* =========================================================================================================================== */
/* ================                                           SYNTH                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Frequency synthezicer (SYNTH)
  */

typedef struct {                                /*!< (@ 0x40083000) SYNTH Structure                                            */
  __IM  uint32_t  STATUS;                       /*!< (@ 0x00000000) STATUS                                                     */
  __OM  uint32_t  CMD;                          /*!< (@ 0x00000004) CMD                                                        */
  __IOM uint32_t  CTRL;                         /*!< (@ 0x00000008) CTRL                                                       */
  __IOM uint32_t  CALCTRL;                      /*!< (@ 0x0000000C) CALCTRL                                                    */
  __IM  uint32_t  RESERVED[5];
  __IOM uint32_t  VCDACCTRL;                    /*!< (@ 0x00000024) VCDACCTRL                                                  */
  __IM  uint32_t  RESERVED1;
  __IOM uint32_t  FREQ;                         /*!< (@ 0x0000002C) FREQ                                                       */
  __IOM uint32_t  IFFREQ;                       /*!< (@ 0x00000030) IFFREQ                                                     */
  __IOM uint32_t  DIVCTRL;                      /*!< (@ 0x00000034) DIVCTRL                                                    */
  __IOM uint32_t  CHCTRL;                       /*!< (@ 0x00000038) CHCTRL                                                     */
  __IOM uint32_t  CHSP;                         /*!< (@ 0x0000003C) CHSP                                                       */
  __IOM uint32_t  CALOFFSET;                    /*!< (@ 0x00000040) CALOFFSET                                                  */
  __IOM uint32_t  VCOTUNING;                    /*!< (@ 0x00000044) VCOTUNING                                                  */
  __IM  uint32_t  RESERVED2;
  __IOM uint32_t  VCORANGE;                     /*!< (@ 0x0000004C) VCORANGE                                                   */
  __IOM uint32_t  VCOGAIN;                      /*!< (@ 0x00000050) VCOGAIN                                                    */
  __IOM uint32_t  AUXVCOTUNING;                 /*!< (@ 0x00000054) AUXVCOTUNING                                               */
  __IOM uint32_t  AUXFREQ;                      /*!< (@ 0x00000058) AUXFREQ                                                    */
  __IOM uint32_t  AUXVCDACCTRL;                 /*!< (@ 0x0000005C) AUXVCDACCTRL                                               */
  __IOM uint32_t  CHPDACCTRL;                   /*!< (@ 0x00000060) CHPDACCTRL                                                 */
  __IOM uint32_t  CAPCALCYCLECNT;               /*!< (@ 0x00000064) CAPCALCYCLECNT                                             */
  __IM  uint32_t  RESERVED3[2];
  __IM  uint32_t  IF;                           /*!< (@ 0x00000070) IF                                                         */
  __OM  uint32_t  IFS;                          /*!< (@ 0x00000074) IFS                                                        */
  __OM  uint32_t  IFC;                          /*!< (@ 0x00000078) IFC                                                        */
  __IOM uint32_t  IEN;                          /*!< (@ 0x0000007C) IEN                                                        */
} SYNTH_Typedef;                                   /*!< Size = 128 (0x80)                                                         */

/***************************************************************************//**
 * @addtogroup EFR32FG1V_SYNTH
 * @{
 * @defgroup EFR32FG1V_SYNTH BitFields  SYNTH Bit Fields
 * @{
 ******************************************************************************/
/* =========================================================================================================================== */
/* ================                                           SYNTH                                           ================ */
/* =========================================================================================================================== */

