VDowbensky/efr32_baremetal/baremetal_test/chip/efr32fg1v_synth.h
#define SYNTH_IF_VCOHIGH_Pos              (4UL)                     /*!< VCOHIGH (Bit 4)                                       */
#define SYNTH_IF_VCOHIGH_Msk              (0x10UL)                  /*!< VCOHIGH (Bitfield-Mask: 0x01)                         */
#define SYNTH_IF_VCOLOW_Pos               (5UL)                     /*!< VCOLOW (Bit 5)                                        */
#define SYNTH_IF_VCOLOW_Msk               (0x20UL)                  /*!< VCOLOW (Bitfield-Mask: 0x01)                          */
#define SYNTH_IF_AUXCAPCALDONE_Pos        (6UL)                     /*!< AUXCAPCALDONE (Bit 6)                                 */
#define SYNTH_IF_AUXCAPCALDONE_Msk        (0x40UL)                  /*!< AUXCAPCALDONE (Bitfield-Mask: 0x01)                   */
#define SYNTH_IF_AUXLOCKED_Pos            (7UL)                     /*!< AUXLOCKED (Bit 7)                                     */
#define SYNTH_IF_AUXLOCKED_Msk            (0x80UL)                  /*!< AUXLOCKED (Bitfield-Mask: 0x01)                       */
#define SYNTH_IF_AUXUNLOCKED_Pos          (8UL)                     /*!< AUXUNLOCKED (Bit 8)                                   */
#define SYNTH_IF_AUXUNLOCKED_Msk          (0x100UL)                 /*!< AUXUNLOCKED (Bitfield-Mask: 0x01)                     */
/* ==========================================================  IFS  ========================================================== */
#define SYNTH_IFS_LOCKED_Pos              (0UL)                     /*!< LOCKED (Bit 0)                                        */
#define SYNTH_IFS_LOCKED_Msk              (0x1UL)                   /*!< LOCKED (Bitfield-Mask: 0x01)                          */
#define SYNTH_IFS_UNLOCKED_Pos            (1UL)                     /*!< UNLOCKED (Bit 1)                                      */
#define SYNTH_IFS_UNLOCKED_Msk            (0x2UL)                   /*!< UNLOCKED (Bitfield-Mask: 0x01)                        */
#define SYNTH_IFS_CAPCALDONE_Pos          (2UL)                     /*!< CAPCALDONE (Bit 2)                                    */
#define SYNTH_IFS_CAPCALDONE_Msk          (0x4UL)                   /*!< CAPCALDONE (Bitfield-Mask: 0x01)                      */
#define SYNTH_IFS_VCOHIGH_Pos             (4UL)                     /*!< VCOHIGH (Bit 4)                                       */
#define SYNTH_IFS_VCOHIGH_Msk             (0x10UL)                  /*!< VCOHIGH (Bitfield-Mask: 0x01)                         */
#define SYNTH_IFS_VCOLOW_Pos              (5UL)                     /*!< VCOLOW (Bit 5)                                        */
#define SYNTH_IFS_VCOLOW_Msk              (0x20UL)                  /*!< VCOLOW (Bitfield-Mask: 0x01)                          */
#define SYNTH_IFS_AUXCAPCALDONE_Pos       (6UL)                     /*!< AUXCAPCALDONE (Bit 6)                                 */
#define SYNTH_IFS_AUXCAPCALDONE_Msk       (0x40UL)                  /*!< AUXCAPCALDONE (Bitfield-Mask: 0x01)                   */
#define SYNTH_IFS_AUXLOCKED_Pos           (7UL)                     /*!< AUXLOCKED (Bit 7)                                     */
#define SYNTH_IFS_AUXLOCKED_Msk           (0x80UL)                  /*!< AUXLOCKED (Bitfield-Mask: 0x01)                       */
#define SYNTH_IFS_AUXUNLOCKED_Pos         (8UL)                     /*!< AUXUNLOCKED (Bit 8)                                   */
#define SYNTH_IFS_AUXUNLOCKED_Msk         (0x100UL)                 /*!< AUXUNLOCKED (Bitfield-Mask: 0x01)                     */
/* ==========================================================  IFC  ========================================================== */
#define SYNTH_IFC_LOCKED_Pos              (0UL)                     /*!< LOCKED (Bit 0)                                        */
#define SYNTH_IFC_LOCKED_Msk              (0x1UL)                   /*!< LOCKED (Bitfield-Mask: 0x01)                          */
#define SYNTH_IFC_UNLOCKED_Pos            (1UL)                     /*!< UNLOCKED (Bit 1)                                      */
#define SYNTH_IFC_UNLOCKED_Msk            (0x2UL)                   /*!< UNLOCKED (Bitfield-Mask: 0x01)                        */
#define SYNTH_IFC_CAPCALDONE_Pos          (2UL)                     /*!< CAPCALDONE (Bit 2)                                    */
#define SYNTH_IFC_CAPCALDONE_Msk          (0x4UL)                   /*!< CAPCALDONE (Bitfield-Mask: 0x01)                      */
#define SYNTH_IFC_VCOHIGH_Pos             (4UL)                     /*!< VCOHIGH (Bit 4)                                       */
#define SYNTH_IFC_VCOHIGH_Msk             (0x10UL)                  /*!< VCOHIGH (Bitfield-Mask: 0x01)                         */
#define SYNTH_IFC_VCOLOW_Pos              (5UL)                     /*!< VCOLOW (Bit 5)                                        */
#define SYNTH_IFC_VCOLOW_Msk              (0x20UL)                  /*!< VCOLOW (Bitfield-Mask: 0x01)                          */
#define SYNTH_IFC_AUXCAPCALDONE_Pos       (6UL)                     /*!< AUXCAPCALDONE (Bit 6)                                 */
#define SYNTH_IFC_AUXCAPCALDONE_Msk       (0x40UL)                  /*!< AUXCAPCALDONE (Bitfield-Mask: 0x01)                   */
#define SYNTH_IFC_AUXLOCKED_Pos           (7UL)                     /*!< AUXLOCKED (Bit 7)                                     */
#define SYNTH_IFC_AUXLOCKED_Msk           (0x80UL)                  /*!< AUXLOCKED (Bitfield-Mask: 0x01)                       */
#define SYNTH_IFC_AUXUNLOCKED_Pos         (8UL)                     /*!< AUXUNLOCKED (Bit 8)                                   */
#define SYNTH_IFC_AUXUNLOCKED_Msk         (0x100UL)                 /*!< AUXUNLOCKED (Bitfield-Mask: 0x01)                     */
/* ==========================================================  IEN  ========================================================== */
#define SYNTH_IEN_LOCKED_Pos              (0UL)                     /*!< LOCKED (Bit 0)                                        */
#define SYNTH_IEN_LOCKED_Msk              (0x1UL)                   /*!< LOCKED (Bitfield-Mask: 0x01)                          */
#define SYNTH_IEN_UNLOCKED_Pos            (1UL)                     /*!< UNLOCKED (Bit 1)                                      */
#define SYNTH_IEN_UNLOCKED_Msk            (0x2UL)                   /*!< UNLOCKED (Bitfield-Mask: 0x01)                        */
#define SYNTH_IEN_CAPCALDONE_Pos          (2UL)                     /*!< CAPCALDONE (Bit 2)                                    */
#define SYNTH_IEN_CAPCALDONE_Msk          (0x4UL)                   /*!< CAPCALDONE (Bitfield-Mask: 0x01)                      */
#define SYNTH_IEN_VCOHIGH_Pos             (4UL)                     /*!< VCOHIGH (Bit 4)                                       */
#define SYNTH_IEN_VCOHIGH_Msk             (0x10UL)                  /*!< VCOHIGH (Bitfield-Mask: 0x01)                         */
#define SYNTH_IEN_VCOLOW_Pos              (5UL)                     /*!< VCOLOW (Bit 5)                                        */
#define SYNTH_IEN_VCOLOW_Msk              (0x20UL)                  /*!< VCOLOW (Bitfield-Mask: 0x01)                          */
#define SYNTH_IEN_AUXCAPCALDONE_Pos       (6UL)                     /*!< AUXCAPCALDONE (Bit 6)                                 */
#define SYNTH_IEN_AUXCAPCALDONE_Msk       (0x40UL)                  /*!< AUXCAPCALDONE (Bitfield-Mask: 0x01)                   */
#define SYNTH_IEN_AUXLOCKED_Pos           (7UL)                     /*!< AUXLOCKED (Bit 7)                                     */
#define SYNTH_IEN_AUXLOCKED_Msk           (0x80UL)                  /*!< AUXLOCKED (Bitfield-Mask: 0x01)                       */
#define SYNTH_IEN_AUXUNLOCKED_Pos         (8UL)                     /*!< AUXUNLOCKED (Bit 8)                                   */
#define SYNTH_IEN_AUXUNLOCKED_Msk         (0x100UL)                 /*!< AUXUNLOCKED (Bitfield-Mask: 0x01)                     */


/** @} */
/** @} End of group EFR32FG1V_SYNTH */
/** @} End of group Parts */
